# 전통적 방법의 선형회귀(기계학습 중 지도학습)
# 각 데이터에 대한 잔차제곱합이 최소가 되는 추세선(회귀선)
# 이를 통해 독립변수가 종속변수에 얼마나 영향을 주는지 인과관계를 분석
# 독립변수: 연속형, 종속변수: 연속형 - 두 변수는 상관관계 및 인과관계가 있어야함
# 정량적인 모델을 생성

import statsmodels.api as sm
from sklearn.datasets import make_regression
import numpy as np

np.random.seed(12)

# 모델 맛보기
# 방법1: make_regression 사용. model 생성X
x, y, coef = make_regression(n_samples=50, n_features=1, bias=100, coef=True)    
# n_feature: 독립변수
print(x)
# [[-1.70073563]
#  [-0.67794537]
#  [ 0.31866529]
#  [ 0.13884618]
#  [ 0.53513589]
#  [-0.03920917]
#  [ 0.03541635]
#  [-0.71385629]
#  [-0.11491994]
#  [ 1.01251548]
#  [ 2.24181779]
#  [ 0.00512708]
#  [-1.02953021]
#  [-0.64743078]
#  [ 0.47298583]
#  [-1.2151688 ]
#  [-0.25390408]
#  [-0.3843588 ]
#  [ 0.52733267]
#  [ 0.47245699]
#  [-0.91386915]
#  [ 0.5018723 ]
#  [-0.68142588]
#  [-2.21333348]
#  [-0.12214979]
#  [-0.57188106]
#  [ 1.34235637]
#  [-1.15436024]
#  [-0.58526828]
#  [-3.14741652]
#  [ 0.21497595]
#  [-1.68175651]
#  [-0.80698188]
#  [ 1.20979645]
#  [ 1.09595612]
#  [-0.59782292]
#  [-0.99720384]
#  [-0.52840432]
#  [-0.12022767]
#  [ 0.07325207]
#  [-0.10586232]
#  [ 0.75314283]
#  [ 0.2424395 ]
#  [-2.21853495]
#  [-1.78809425]
#  [ 2.87181939]
#  [ 1.33583134]
#  [-1.53472134]
#  [ 0.64076111]
#  [-0.33759525]]
print(y)
# [ -52.17214291   39.34130801  128.51235594  112.42316554  147.88091341
#    96.49178624  103.16885304   36.12820309   89.71761789  190.59412103
#   300.58509445  100.45874176    7.88349776   42.07157936  142.32007968
#    -8.72638684   77.28210847   65.60976235  147.18272498  142.27276227
#    18.23219105  144.90467678   39.0298914   -98.0364801    89.07073235
#    48.8313381   220.10640661   -3.28558253   47.63352619 -181.61291334
#   119.23482409  -50.47399897   27.79585534  208.24569942  198.05991459
#    46.51020834   10.77587732   52.72138937   89.24271248  106.55417864
#    90.52804266  167.38693344  121.69210605  -98.50187763  -59.98849467
#   356.95405132  219.52258382  -37.31812896  157.33165682   69.79389882]
print(coef)
# 89.47430739278907

# y = wx + b        y^ = 89.47430739278907 * x + 100
y_pred = 89.47430739278907 * -1.70073563 + 100
print("예측값: ",y_pred)

print("\n방법2: LinearRegression 사용. model 생성 O")
from sklearn.linear_model import LinearRegression
model = LinearRegression()

xx = x
yy = y

fit_model = model.fit(xx,yy)    # 최소제곱법으로 기울기 절편을 반환

print('기울기(slope): ', fit_model.coef_)       # 89.47430739
print("절편(bias): ", fit_model.intercept_)     # 100.0

# 예측값 확인 함수
y_newpred = fit_model.predict(xx[[0]])
print("예측값: ",y_newpred)
y_newpred2 = fit_model.predict(np.array([[0.12345],[0.3],[0.5]]))
print("예측값2: ",y_newpred2)

print("\n방법 3: ols 사용. model 생성 O")
# 잔차제곱합(RSS)을 최소화하는 가중치 벡터를 행렬 미분으로 구하는 방법
import statsmodels.formula.api as smf
import pandas as pd
print(xx.ndim)      # 2 출력 -- 2차원

x1 = xx.flatten()   # 차원 축소
print(x1.ndim)      # 1차원됨

y1 = yy

data = np.array([x1,y1])
# print(data)
df = pd.DataFrame(data).T
print(df)
#            0           1
# 0  -1.700736  -52.172143
# 1  -0.677945   39.341308
# 2   0.318665  128.512356
# 3   0.138846  112.423166
# 4   ...       ...
df.columns = ['x1','y1']
print(df.head(3))

model2 = smf.ols(formula='y1 ~ x1', data=df).fit()      # 표현식 정리필요
print(model2.summary()) 
#                             OLS Regression Results
# ==============================================================================
# Dep. Variable:                     y1   R-squared:                       1.000
# Model:                            OLS   Adj. R-squared:                  1.000
# Method:                 Least Squares   F-statistic:                 1.905e+32
# Date:                Fri, 03 Apr 2026   Prob (F-statistic):               0.00
# Time:                        11:03:10   Log-Likelihood:                 1460.6
# No. Observations:                  50   AIC:                            -2917.
# Df Residuals:                      48   BIC:                            -2913.
# Df Model:                           1
# Covariance Type:            nonrobust
# ==============================================================================
#                  coef    std err          t      P>|t|      [0.025      0.975]
# ------------------------------------------------------------------------------
# Intercept    100.0000   7.33e-15   1.36e+16      0.000     100.000     100.000
# x1            89.4743   6.48e-15   1.38e+16      0.000      89.474      89.474
# ==============================================================================
# Omnibus:                        7.616   Durbin-Watson:                   1.798
# Prob(Omnibus):                  0.022   Jarque-Bera (JB):                8.746
# Skew:                           0.516   Prob(JB):                       0.0126
# Kurtosis:                       4.770   Cond. No.                         1.26
# ==============================================================================
# Notes:
# [1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

# ** P>|t| 값이 인과관계가 있는지 없는지 설명해준다. **

print("기울기: ", model2.params['x1'])
print("절편: ", model2.params['Intercept'])

# 예측값 확인
new_df = pd.DataFrame({'x1':[-1.70073563, -0.67794537]})  # 기존 자료 검증
print("예측값1: ", model2.predict(new_df))
# 예측값1:  0   -52.172143
# 1    39.341308
# dtype: float64
new_df2 = pd.DataFrame({'x1':[0.1234, 0.2345]})  # 새로운 자료 검증(원래 없던 값)
print("예측값2: ", model2.predict(new_df2))
# 예측값2:  0    111.041130
# 1    120.981725
# dtype: float64





